In [1]:
import pandas as pd

In [7]:
df1 = pd.read_csv('data_2023-02-11.csv', delimiter=';')

In [8]:
df1

  company  metric_id       metric_desc  metric_value metric_date
0  i-bank          1  active contracts         10000  2023-02-11
1  i-bank          2  active customers         50000  2023-02-11
2  i-bank          3   employees count           100  2023-02-11
3  i-bank          4   active partners          1000  2023-02-11
4  i-bank          5   unique products             5  2023-02-11

In [9]:
df2 = pd.read_csv('data_2023-02-12.csv', delimiter=';')

In [10]:
df2

  company  metric_id       metric_desc  metric_value metric_date
0  i-bank          1  active contracts         12000  2023-02-12
1  i-bank          2  active customers         50500  2023-02-12
2  i-bank          3   employees count           101  2023-02-12
3  i-bank          4   active partners          1005  2023-02-12
4  i-bank          5   unique products             5  2023-02-12

## Unionized data for weekend

In [12]:
unioned_df = pd.concat([df1, df2])
unioned_df

  company  metric_id       metric_desc  metric_value metric_date
0  i-bank          1  active contracts         10000  2023-02-11
1  i-bank          2  active customers         50000  2023-02-11
2  i-bank          3   employees count           100  2023-02-11
3  i-bank          4   active partners          1000  2023-02-11
4  i-bank          5   unique products             5  2023-02-11
0  i-bank          1  active contracts         12000  2023-02-12
1  i-bank          2  active customers         50500  2023-02-12
2  i-bank          3   employees count           101  2023-02-12
3  i-bank          4   active partners          1005  2023-02-12
4  i-bank          5   unique products             5  2023-02-12

In [20]:
current_timestamp = pd.Timestamp.now()
unioned_df.insert(5,'combined_date', current_timestamp)

In [22]:
unioned_df.to_csv('unioned_weekend_data.csv')

## Aggregated data for weekend

In [25]:
combined_df = pd.concat([df1, df2])

combined_df = combined_df.groupby(['company', 'metric_id', 'metric_desc'], as_index=False)['metric_value'].sum()

combined_df.insert(4, 'aggregated_data_date', current_timestamp)

In [27]:
combined_df.to_csv('aggregated_weekend_data.csv')